https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dtypes.html

# 1. Create a DataFrame

Dataframe is a 2D data structure.

## a. Create dataframe from dictionary of lists

In [6]:
import pandas as pd
data ={'Name': ['Karan','Rohit','Sahil','Aryan'], 'Age': [23,22,21,24] }
df = pd.DataFrame(data)
df

    Name  Age
0  Karan   23
1  Rohit   22
2  Sahil   21
3  Aryan   24

## b. Create dataframe from list of lists

In [9]:
data=[['Karan',23],['Rohit',22],['Sahil',21],['Aryan',24]]
df = pd.DataFrame(data , columns =['Name','Age'])
df

    Name  Age
0  Karan   23
1  Rohit   22
2  Sahil   21
3  Aryan   24

# 2. Create customized index dataframe

In [11]:
data={'Name':['Karan','Rohit','Sahil','Aryan'],'Age':[23,22,21,24]}
df = pd.DataFrame(data, index =['No.1','No.2','No.3','No.4'])
df

       Name  Age
No.1  Karan   23
No.2  Rohit   22
No.3  Sahil   21
No.4  Aryan   24

# 3.  .isna( )

Calling 
the 
.isna( )
method 
on 
a 
DataFrame 
produces 
a 
Boolean 
for 
every 
value 
depending 
on 
whether 
the 
value 
is 
missing 
or 
not

In [ ]:
scores.isna().head()

In [ ]:
   school    math  reading  writing
0   False   False    False    False
1   False   False    False    False
2   False   False     True     True
3   False   False    False     True
4   False    True     True    False

In [ ]:
scores.isna().any()

In [ ]:
school    False
math       True
reading    True
writing    True
dtype: bool

In [ ]:
scores.isna().sum

In [ ]:
school     0
math      60
reading   47
writing   53
dtype: int64

In [ ]:
# visulisation

import matplotlib.pyplot as plt
sat_scores.isna().sum().plot(kind='bar')
plt.show()

# 4. df.to_csv( 'xxxx.csv')

### Save DataFrame as a csv

# 5. Plot

Use Matplotlib.pyplot as plt 

### df.plot(x ='', y ='', kind ='')

kind = 'line'/'bar'/'hist'/'scatter'/'kde'.....

# 6. df.groupby( 'column_A') ['column_B']

### df.groupby('A') ['B'].mean( )

### df.groupby('A')['B'].agg([ 'max' , 'sum' ])

# 7. pivot_table()


The 
.pivot_table()
method 
allows 
you 
to 
group 
by 
two 
variables, 
similarly 
to 
.groupby()
, 
to 
create 
a 
pivot 
table

## pivot_table(values=None, index=None, columns=None, aggfunc='mean',dropna=True)

# 8. Check the df

## df.head( )

## df.info( )

## df.describe( )

## df.shape !!!!! No paranthese, because shape is an attribute

# 9. df['column_A'].value_counts( )

## df['column_A'].value_counts( sort = True)

##  df['column_A'].value_counts( normalize = True)  
proportions 
of 
the 
total.

# 10.df.drop( )

## a. drop columns: df.drop(['A','B'], axis = 1)

## b. drop rows: df.drop(['A','B'], axis = 0)

## dropna(inplace = True)

## 11. to NumPy

In [12]:
df = pd.DataFrame({'age':    [ 3,  29],
                   'height': [94, 170],
                   'weight': [31, 115]})

df.head()

   age  height  weight
0    3      94      31
1   29     170     115

In [13]:
df.values

array([[  3,  94,  31],
       [ 29, 170, 115]])

In [14]:
df.to_numpy()

array([[  3,  94,  31],
       [ 29, 170, 115]])

# 12. df.loc[ ]

## df.loc['A']
## df.loc[['A','B']] 

# ----------------------------------------------------------------

# df.iloc[ ]

## df.iloc[0]
## df.iloc[:3]
## df.iloc[ [0,2], [1,3]]
## df.iloc[1:3, 2:4]
## df.iloc[ lambda x: x.index % 2 == 0]

# 13. 
## df.items( )
## df.keys( )
## df.values( )

# 14. df.where( )

## df.where(condition1 & condition2 , inplace = True)

## df.where(con1&cond2 , 0 , inplace = True)

# 15. df.apply( )

## df.apply( np.sqrt)

In [ ]:
# 16. df.count( )

Count non-NA cells for each column or row.

# 16. Duplicates

## df.drop_duplicates( )

## df.duplicated( )
Return boolean Series denoting duplicate rows.

# 16. Fill

## df.fillna()
df.fillna(value=None, method = None)

Method: 'backfill','bfill','pad','ffill',None 

## df.bfill() & df.ffill()

# 17. df.sort_values

## df.sort_values(by = ['col1'])

## df.sort_values(by =['col1','col2'] , ascending = True/False)

# 18. df.sort_index( )


## df.sort_index( ascending = False)

# 19. 

## df.nlargest(n , columns, keep = 'last'/'first' / 'all')

#### df.nlargest(3, 'population', keep = 'all')
#### df.nlargest(4, ['population', ' GDP'], keep='first')

## df.nsmallest(n,columns, keep =  'last'/'first' / 'all')

# 20.  Add Category Column to pandas DataFrame with cut

In [17]:
df = pd.DataFrame({"A": ["a", "b", "c", "a"]})
df

   A
0  a
1  b
2  c
3  a

By converting an existing Series or column to a category dtype:

In [19]:
df["B"] = df["A"].astype("category")
df

   A  B
0  a  a
1  b  b
2  c  c
3  a  a

By using special functions, such as cut(), which groups data into discrete bins. See the example on tiling in the docs.

In [68]:
import numpy as np

df = pd.DataFrame({"value": np.random.randint(0, 100, 20)})
df

    value
0      98
1       7
2      39
3      66
4      72
5       5
6      66
7      54
8      88
9      93
10     63
11      4
12      1
13      1
14     67
15      8
16     16
17     51
18     13
19     97

In [71]:
labels = ['0-9','10-19','20-29','30-39','40-49','50-59','60-69','70-79','80-89','90-100']

df['group'] = pd.cut(df['value'], bins = [0,9,19,29,39,49,59,69,79,89,100], right =False, labels =labels)
df.head()

   value   group
0     98  90-100
1      7     0-9
2     39   40-49
3     66   60-69
4     72   70-79

In [72]:
labels = [f"{i} - {i+9}"  for i in range(0, 100, 10)]

labels

['0 - 9',
 '10 - 19',
 '20 - 29',
 '30 - 39',
 '40 - 49',
 '50 - 59',
 '60 - 69',
 '70 - 79',
 '80 - 89',
 '90 - 99']

In [73]:
df["group"] = pd.cut(df.value, range(0, 105, 10))
df.head()

   value      group
0     98  (90, 100]
1      7    (0, 10]
2     39   (30, 40]
3     66   (60, 70]
4     72   (70, 80]

In [78]:
df["group"] = pd.cut(df.value, range(0, 101, 10), right=False, labels=labels) 
# labels: Specifies the labels for the returned bins. 
df.head()

   value    group
0     98  90 - 99
1      7    0 - 9
2     39  30 - 39
3     66  60 - 69
4     72  70 - 79

https://mungingdata.com/pandas/dataframe-cut-category/

In [45]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {"first_names": ["Todd", "Juan", "Maria", "Hi", "Sal"], "age": [12, 13, 19, 20, 42]}
)
df

  first_names  age
0        Todd   12
1        Juan   13
2       Maria   19
3          Hi   20
4         Sal   42

Add an age_bins column to the DataFrame that categorizes the people into these buckets: child, teenager, or adult.

The rightmost value is inclusive in the bins argument, so the buckets are 1-12, 13-19, and 20-infinity.

In [48]:
df['age_group'] = pd.cut(
df['age'], 
bins = [1,12,19,np.inf],
labels = ['child','teenager','adult'])

df

  first_names  age age_group
0        Todd   12     child
1        Juan   13  teenager
2       Maria   19  teenager
3          Hi   20     adult
4         Sal   42     adult

# 21. df.rename( )

## df.rename (columns = {"A":"newA", "B":"newB"})

## df.rename(index ={0:"x",1:'y',2:'z'})



## df.rename(str.lower, axis = 'columns' )

## df.rename({1:2,2:4}, axis = 'index')

# 22. Index

## a. df.set_index( )

In [49]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [52]:
df.set_index('month',inplace = True)
df

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [55]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

df.set_index(['month','year'], inplace=True)
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

## b. df.reset_index( )

In [60]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [61]:
df.reset_index(inplace=True)
df

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [66]:
df.rename(columns = {'index':"No."},inplace=True)
df

      No.   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [59]:
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                  index=['falcon', 'parrot', 'lion', 'monkey'],
                  columns=('class', 'max_speed'))

df.reset_index(drop=True,inplace=True)
df

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN